IRP/src/AccumulationRegisters/PartnerArTransactions/PartnerArTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>PartnerArTransactions</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BasisDocument</name>
    <type>
      <types>DefinedType.typeArTransactionBasises</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/PartnerArTransactions/ManagerModule.bsl
Function GetLockFields(Data) Export
	Result = New Structure();
	Result.Insert("RegisterName", "AccumulationRegister.PartnerArTransactions");
	Result.Insert("LockInfo", New Structure("Data, Fields", 
	Data, PostingServer.GetLockFieldsMap(GetLockFieldNames())));
	Return Result;
EndFunction

Function GetLockFieldNames() Export
	Return "Company, Partner, LegalName, Agreement, Currency";
EndFunction

Function GetTablePartnerArTransactions_OffsetOfAdvance(RegisterRecords, PointInTime, AdvanceFromCustomers, PartnerArTransactions) Export
	RegisterRecords.PartnerArTransactions.Clear();
	RegisterRecords.PartnerArTransactions.Write();
	Return PostingServer.GetTable_OffsetOfAdvance_OnAdvance(PointInTime, AdvanceFromCustomers, PartnerArTransactions, "ReceiptDocument");
EndFunction
